import { Dispatch, FC, SetStateAction } from 'react';
import { Modal } from '../modal';
import { workshopCookieHandler } from '@/utils/workshop-cookie-hander';

type PDPAModalProps = {
  isAccepted: boolean;
  setIsAccepted: Dispatch<SetStateAction<boolean>>;
};

const PDPAModal: FC<PDPAModalProps> = ({ isAccepted, setIsAccepted }) => {
  const handleAccept = () => {
    setIsAccepted(true);
    workshopCookieHandler.setPDPA(true);
  };
  return (
    <Modal isOpen={!isAccepted} setIsOpen={setIsAccepted}>
      <div
        onClick={(e) => e.stopPropagation()}
        className='bg-white w-11/12 lg:w-4/6 h-5/6 lg:h-5/6 rounded-2xl px-4 py-10 lg:py-10 lg:px-16 overflow-y-scroll flex flex-col'
      >
        <div>
          <p className='text-[#1C3FB7] font-bold lg:text-xl'>
            หนังสือยินยอมเพื่อขอใช้ประโยชน์ข้อมูลส่วนบุคคล
          </p>
        </div>
        <div className=' flex-grow'>
          <p className='text-xs lg:text-sm font-light mt-3 leading-6'>
            &emsp;&emsp;คณะเทคโนโลยีสารสนเทศ มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าธนบุรี
            ให้ความสำคัญด้านการเคารพสิทธิในความเป็นส่วนตัว
            และการรักษาความปลอดภัยของข้อมูลส่วนบุคคลของท่าน โดยคณะฯ ได้กำหนดนโยบาย ระเบียบ
            และหลักเกณฑ์ต่าง ๆ ในการดำเนินงาน ของคณะ ฯ เพื่อให้เป็นไปตามมาตรฐาน
            ในการรักษาความปลอดภัยของข้อมูลส่วนบุคคล เพื่อให้ท่านได้มั่นใจว่า
            ข้อมูลส่วนบุคคลของท่านที่คณะ ฯ ได้รับจะถูกนำไปใช้ ตรงตามความต้องการของท่าน
            และถูกต้องตามกฎหมาย โดยคณะ ฯ จะจัดเก็บข้อมูลส่วนบุคคลของท่านตลอดระยะเวลา ที่จำเป็น
            ในการดำเนินการตามวัตถุประสงค์ของคณะ ฯ รวมถึงงานต่าง ๆ ที่จำเป็น <br />{' '}
            &emsp;&emsp;ทางคณะ ฯ เก็บ รวบรวมและใช้ข้อมูลส่วนบุคคลของท่าน รวมทั้งภาพถ่าย และวีดีโอ
            ที่เกิดจากการเข้าร่วมกิจกรรมของท่าน ซึ่งจัดโดยมหาวิทยาลัย คณะ ฯ และ/หรือนักศึกษา
            เพื่อวัตถุประสงค์ของคณะฯ ตลอดจนตามวัตถุประสงค์ดังต่อไปนี้ <br /> &emsp;1.
            เพื่อประโยชน์ทางการศึกษา การวิเคราะห์ ประมวลผล จัดทำสถิติ รวมไปถึงการจัดบริการต่าง ๆ
            เช่น การแนะแนว การสมัครงาน การพัฒนาทักษะด้านต่าง ๆ <br />
            &emsp;2. เพื่อจัดทำสื่อโฆษณา การเผยแพร่การประชาสัมพันธ์ต่อสาธารณะ
            ผ่านช่องทางสื่ออิเล็กทรอนิกส์ สื่อออนไลน์ สื่อวิดีโอ สื่อสิ่งพิมพ์ต่าง ๆ เช่น เว็บไซต์
            Social Media การติดประกาศ และช่องทางอื่น ๆ
            <br />
            &emsp;3. เพื่อใช้ข้อมูลของท่านในการแจ้งข้อมูลข่าวสาร การเรียนการสอน บริการของคณะ ฯ
            และการโฆษณาประชาสัมพันธ์ เช่น การเปิดรับสมัครนักศึกษาใหม่ การอบรม
            หรือกิจกรรมที่เกี่ยวข้อง
            <br />
            &emsp;4. วัตถุประสงค์อื่น ๆ เพื่อประโยชน์ของคณะฯ และ/หรือมหาวิทยาลัย และ/หรือนักศึกษา{' '}
            <br />
            &emsp;5. ทางคณะฯ
            ได้เก็บข้อมูลบัตรประชาชนของท่านเพื่อใช้ในการสร้างรหัสเฉพาะสำหรับแต่ละบุคคล
            โดยจะไม่มีการจัดเก็บหมายเลขบัตรประชาชนต้นฉบับ
            เนื่องจากหมายเลขบัตรของท่านจะถูกทำการเข้ารหัสทันทีเพื่อรักษาความปลอดภัยและให้เป็นไปตามมาตรฐานการคุ้มครองข้อมูลส่วนบุคคล
            <br />
            &emsp;&emsp;ทั้งนี้ ท่านมีสิทธิที่จะถอนความยินยอมหรือขอให้คณะ ฯ
            ลบข้อมูลเมื่อใดก็ได้ตลอดระยะเวลาที่ข้อมูลส่วนบุคคลของท่านอยู่กับคณะ ฯ
            อย่างไรก็ตามการถอนความยินยอมของท่านอาจส่งผลกระทบต่อท่านจากการใช้บริการต่าง ๆ เช่น
            ท่านจะไม่ได้รับสิทธิประโยชน์ที่ทางคณะ ฯ ให้บริการอยู่
            หรือไม่ได้รับข้อมูลข่าวสารอันเป็นประโยชน์แก่ท่าน เป็นต้น
            <br />
            &emsp;&emsp;ดังนั้นเพื่อประโยชน์ของท่านจึงควรศึกษาและสอบถามถึงผลกระทบ
            ก่อนเพิกถอนความยินยอมดังกล่าว กรณีที่ท่านต้องการถอนความยินยอมกรุณาติดต่อผ่านอีเมล
            info@sit.kmutt.ac.th
          </p>
        </div>
        <div
          className='Button font-bold text-white bg-[#1C3FB7] w-fit px-6 py-3 rounded-xl mx-auto mt-10 cursor-pointer'
          onClick={handleAccept}
        >
          รับทราบและดำเนินการต่อ
        </div>
      </div>
    </Modal>
  );
};

export { PDPAModal };
